[
  {
    "path": "posts/2022-02-02-describing-the-network-data/",
    "title": "Describing the Network Data",
    "description": "From raw data to network data",
    "author": [
      {
        "name": "Santiago Virgüez",
        "url": {}
      }
    ],
    "date": "2022-02-02",
    "categories": [],
    "contents": "\nAs mentioned in the previous post, I’m working with a new database on the IAcHR rulings compiled by the PluriCourts project of the University of Oslo (Stiansen, Naurin, and Bøyum 2020). This dataset of amici actors has 425 observations of 2 variables (“Name of Amicus” and “Case ID”), indicating in which cases an amici actor participated in:\nA view of the dataset on amiciFrom raw data to an adjacency matrix\nIn order to work with this dataset, I need to put the data into a format that is suitable for network analysis. So, after cleaning the data, I create an adjacency matrix (nxn) where I can see how many times interveners have filed an amicus brief in the same case than each other.\n\n\ndata <- read.csv(\"CleanedData.csv\")\n\n#New column count\ndata$count <- 1\n\nlibrary(tidyr)\n\n#Gather the data at case level\nlev_data <- pivot_wider(data,id_cols = CaseID, names_from = `Name.of.Amicus`, values_from = count, values_fn = list(count = length), values_fill = list(count = 0))\n\n#Create the adjacency matrix\nmat <- as.matrix(lev_data[-1])\nad_matrix <- t(mat) %*% mat\n\n\n\nAdjacency matrixDescribing the network dataset\nBefore describing the network dataset, I need first to create a network object from the dataset loaded (the adjacency network):\n\n\nlibrary(igraph)\namici_network <- graph.adjacency(ad_matrix, mode = \"undirected\", weighted = TRUE)\n\nis_directed(amici_network)\n\n\n[1] FALSE\n\nis_weighted(amici_network)\n\n\n[1] TRUE\n\nis_bipartite(amici_network)\n\n\n[1] FALSE\n\nNow, I can identify and describe content of nodes and links, and identify format of data set, Of course, from the previous steps we know that this a matrix, symmetric, and weighted. This means that each time there is a connection between two amici, each of them is filing a briefe before the court (symetrical), but these ties among amici are valued according to how many time they have intervened in the same cases.\nWe can also identify the network attributes:\n\n\n#size\nvcount(amici_network)\n\n\n[1] 403\n\necount(amici_network)\n\n\n[1] 4018\n\n#attributes names and content\nvertex_attr_names(amici_network)\n\n\n[1] \"name\"\n\nedge_attr_names(amici_network)\n\n\n[1] \"weight\"\n\nhead(V(amici_network)$name)\n\n\n[1] \"Fernando Linares Beltranena\"                                                     \n[2] \"Amnesty International\"                                                           \n[3] \"Association of the Bar of the City of New York\"                                  \n[4] \"Lawyers Committee for Human Rights\"                                              \n[5] \" The Central American Associaion of Families of Detained and Disappeared Persons\"\n[6] \"Minnesota Lawyers International Human Rights Committee\"                          \n\nhead(E(amici_network)$weight)\n\n\n[1] 1 9 2 2 1 3\n\nIt is also possible to describe the network structure:\n\n\n#Dyad census: because the ties are undirected we will expect that there is no assymetrical edges\nigraph::dyad.census(amici_network)\n\n\n$mut\n[1] 4018\n\n$asym\n[1] 0\n\n$null\n[1] 76985\n\n#Triad census\nigraph::triad_census(amici_network)\n\n\n [1] 9455588       0 1331612       0       0       0       0       0\n [9]       0       0    2600       0       0       0       0   37601\n\nIn terms of transitivity or global clustering, it is possible to see how the proption of connected triads in the network of amici that are complete is hight, meaning that almost all connected triads are transitive. Likewise, the local clustering coefficient (emphasis on low degree nodes) confirms the high transitivity of the network:\n\n\n#global clustering\ntransitivity(amici_network)\n\n\n[1] 0.9774703\n\n#local clustering coefficient\ntransitivity(amici_network, type=\"average\")\n\n\n[1] 0.9920321\n\n\n\n\n",
    "preview": {},
    "last_modified": "2022-02-02T18:22:30-05:00",
    "input_file": "describing-the-network-data.knit.md"
  },
  {
    "path": "posts/2022-01-26-project-and-network-data/",
    "title": "Description and Network Data",
    "description": "Read about the project and the network data",
    "author": [
      {
        "name": "Santiago Virgüez",
        "url": {}
      }
    ],
    "date": "2022-01-27",
    "categories": [],
    "contents": "\nIAcHRHave interest groups in the Inter-American Court of Human Rights (IAcHR) come to work together? How have their coalition strategies changed over time? The increasing legitimacy of amici participation in national courts have paved the way for interest groups (particularly nongovernmental organizations) to increase amici advocacy before international courts (Johnson and Amerasinghe 2009). Amicus briefs are perceived as one of the most effective and less costly methods of legal advocacy to nonjudicial actors (Krislov 1963). For this reason, scholars have begun to construct networks based on amicus briefs. Nevertheless, as Box-Steffensmeier et. al. (2017) have argued, these constructions provide little clue as to who works with whom and how interest actors change their coalition strategies over time.\nTo address these questions, I want to undertake an empirical study based on a new database on the IAcHR rulings compiled by the PluriCourts project of the University of Oslo (Stiansen, Naurin, and Bøyum 2020). I will update their Dataset on amici actors (See file “IACtHRamici.RDATA”) to include some new cases decided by the IAcHR and turn it into network data. This specific dataset has 425 observations of 2 variables (“Name of Amicus” and “Case ID”), indicating in which cases an amici actor participated in.\n\n\n\n",
    "preview": {},
    "last_modified": "2022-02-02T18:28:09-05:00",
    "input_file": "project-and-network-data.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome!",
    "description": "This is my new blog 'Friends of the Court'. I hope you enjoy \nreading about networks of amici actors in the Inter-American Court of Human Rights",
    "author": [
      {
        "name": "Santiago Virgüez",
        "url": {}
      }
    ],
    "date": "2022-01-26",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2022-01-26T23:17:05-05:00",
    "input_file": "welcome.knit.md"
  }
]
