[
  {
    "path": "posts/2022-02-09-degree-and-centrality-in-the-iachr-network/",
    "title": "Degree and Centrality in the IAcHR Network",
    "description": "Degree and centrality analysis usign the network data",
    "author": [
      {
        "name": "Santiago Virgüez",
        "url": {}
      }
    ],
    "date": "2022-02-09",
    "categories": [],
    "contents": "\nRecap\nBefore analyzing the degree and centrality of some of the nodes of the IAcHR network, lets recall briefly how I organized the network data in the previous post:\n\n\nlibrary(tidyr)\ndata <- read.csv(\"CleanedData.csv\")\n#New column count\ndata$count <- 1\n\n#Gather the data at case level\nlev_data <- pivot_wider(data,id_cols = CaseID, names_from = `Name.of.Amicus`, values_from = count, values_fn = list(count = length), values_fill = list(count = 0))\n\n#Create the adjacency matrix\nmat <- as.matrix(lev_data[-1])\nad_matrix <- t(mat) %*% mat\n\n#Ignore the ties from a node to itself \ndiag(ad_matrix) <- 0\n\n\n\nUsing this matrix, I created an adjacency graph:\n\n\nlibrary(igraph)\namici_network <- graph.adjacency(ad_matrix, mode = \"undirected\", weighted = TRUE)\n\n\n\nAffiliation Network Data\nNevertheless, from previous posts we know that the amici data I am working with has the following characteristics:\nNodes: Actors (individuals or organizations) that have filed at least one amicus brief before the Inter-American Court of Human Rights\nTies: If an actor has filed a brief in the same case than other actor, there is a tie.\nAs you can see, the network is not based on a direct tie between the amici actors. They are connected by virtue of filing a brief in the same case. This means that we are dealing with an affiliation network, that is a network where the members are affiliated with one another based on co-membership in a group, or co-participation in some type of event (in this case the event is a legal case).\nThe affiliation is then organized as a 2-mode network, where amici actors are grouped by cases. We need to re-organize the matrix at the case level (see “lev_data” above) and create an ‘incidence’ matrix::\n\n\n#transpose lev_data to have amici grouped by case\nlibrary(data.table)\nT_lev_data <- transpose(lev_data,)\nrownames(T_lev_data) <- colnames(lev_data)\ncolnames(T_lev_data) <- lev_data$CaseID\nT_lev_data <- T_lev_data[-c(1),]\n\n\n\n2-mode neworkSo, in this affiliation network, there are two types of nodes: one type for the amici actors, and another type for the legal cases (case 16, case 18 …) to which the actors belong. Ties then connect the actors to those cases. In orther to work with this affiliation network in r, we need to create an ‘incidence’ graph.\nThe ‘graph.incidence’ function takes a matrix or data.frame and transforms it into an affiliation network, reading the rows as actors and the columns as the cases.\n\n\n#create graph using 'igraph'\nAff_network <- graph.incidence(T_lev_data)\n\n#description of the graph\n\n##size\nvcount(Aff_network)\n\n\n[1] 482\n\necount(Aff_network)\n\n\n[1] 421\n\n##ties\nis_bipartite(Aff_network)\n\n\n[1] TRUE\n\nis_directed(Aff_network)\n\n\n[1] FALSE\n\nis_weighted(Aff_network)\n\n\n[1] FALSE\n\nOne-Mode matrix (actor x actor / case x case)\nIn order to study athe affiliation network, we need to study both types of nodes (actors and cases). To do this, it may be useful to examine the direct connections among the nodes of one type at a time by extracting the one-mode projections of the two-mode affiliation network:\n\n\n#extracting the one-mode projections \nAff_network.pr <- bipartite.projection(Aff_network)\nAff_network.pr\n\n\n$proj1\nIGRAPH b36202f UNW- 403 3615 -- \n+ attr: name (v/c), weight (e/n)\n+ edges from b36202f (vertex names):\n[1] Amnesty International--Association of the Bar of the City of New York                                  \n[2] Amnesty International--Lawyers Committee for Human Rights                                              \n[3] Amnesty International-- The Central American Associaion of Families of Detained and Disappeared Persons\n[4] Amnesty International--Minnesota Lawyers International Human Rights Committee                          \n+ ... omitted several edges\n\n$proj2\nIGRAPH 83d6c75 UNW- 79 43 -- \n+ attr: name (v/c), weight (e/n)\n+ edges from 83d6c75 (vertex names):\n [1] 18 --19  18 --20  18 --53  18 --82  18 --127 18 --190 18 --193\n [8] 18 --204 19 --20  19 --53  19 --82  19 --127 19 --190 19 --193\n[15] 19 --204 20 --53  20 --82  20 --127 20 --190 20 --193 20 --204\n[22] 22 --58  22 --85  53 --82  53 --127 53 --190 53 --193 53 --204\n[29] 53 --203 56 --102 58 --85  167--152 82 --127 82 --190 82 --193\n[36] 82 --204 99 --133 127--190 127--193 127--204 190--193 190--204\n[43] 193--204\n\nThen we can create two different adjacency graphs (actor x actor) (case x case) base on the projections\n\n\namici_net <- Aff_network.pr$proj1\ncase_net <- Aff_network.pr$proj2\n\namici_ad <- graph.adjacency(get.adjacency(amici_net, sparse = FALSE,attr = \"weight\"))\ncase_ad <- graph.adjacency(get.adjacency(case_net, sparse = FALSE,attr = \"weight\"))\n\n#describe both graphs\n##size\nvcount(amici_ad)\n\n\n[1] 403\n\necount(amici_ad)\n\n\n[1] 7244\n\nvcount(case_ad)\n\n\n[1] 79\n\necount(case_ad)\n\n\n[1] 96\n\nDensity, Degree, and Centrality of the Network\nUsing the adjacency graphs we can measure the network density and centralization:\n\n\n#density\ngraph.density(amici_ad)\n\n\n[1] 0.04471439\n\ngraph.density(case_ad)\n\n\n[1] 0.01557936\n\nIt is possible to see how both graphs (actorxactor/casexcase) have a really low densisity. That means that most of amici actors do not oftenly file amicus briefs in the same cases (likewise, cases are not usually tied by amici interventions). This is understandable given the fact that cases come from different countries, and amici actors tend to be local organizations or individuals, so it is unlikely that they participate in cases from other countries.\nThis finding is also confirmed by lower level of centralization of the actor x actor graph, which shows that th eamici actors have a lower level of cohesion or integration between each other:\n\n\ncentr_degree(amici_ad, loops = FALSE, mode = \"total\")$centralization\n\n\n[1] 0.1450602\n\nIn order to analize the degree and centrality of the amici actors, we first create a dataset with the name a degree of all the nodes in this graph. Then we can see how the distribution of node degree for the amici actor network, based on what we already have seen, has a long tail on the left.\n\n\namici.nodes<-data.frame(name=V(amici_ad)$name, degree=igraph::degree(amici_ad))\n\n#distribution\nhist(amici.nodes$degree, main = \"Amici Influence: Degree Distribution\", xlab = \"Times filed a brief with other actor\")\n\n\n\n\nAlthough most of the actors have a lower degree, it is interesting to see that some organizations have an outstanding degree level:\n\n\nlibrary(dplyr)\narrange(amici.nodes, desc(degree))%>%slice(1:3)\n\n\n                                                                                                                           name\nCentro de Estudios of Derecho, Justicia y Sociedad (DEJUSTICIA) Centro de Estudios of Derecho, Justicia y Sociedad (DEJUSTICIA)\nCenter for Justice and International Law                                               Center for Justice and International Law\nAmnesty International                                                                                     Amnesty International\n                                                                degree\nCentro de Estudios of Derecho, Justicia y Sociedad (DEJUSTICIA)    152\nCenter for Justice and International Law                           102\nAmnesty International                                               94\n\nIt is not surprising that international organizations such as Amnesty International or the Center for International Law have higher degree, since they have political interest over several countries and more (in contrast with local NGOs) as well as more resources. What is interesting is the prominence of Dejusticia, a Colombian NGO with the highest score of degree centrality. As a local advocacy organization one might expect a minor involvement in legal cases outside of its base country; nevertheless it would be interesting to explore what is the reason behind its degree centrality.\n\n\n\n",
    "preview": "posts/2022-02-09-degree-and-centrality-in-the-iachr-network/degree-and-centrality-in-the-iachr-network_files/figure-html5/unnamed-chunk-9-1.png",
    "last_modified": "2022-02-09T22:49:11-05:00",
    "input_file": "degree-and-centrality-in-the-iachr-network.knit.md"
  },
  {
    "path": "posts/2022-02-02-describing-the-network-data/",
    "title": "Describing the Network Data",
    "description": "From raw data to network data",
    "author": [
      {
        "name": "Santiago Virgüez",
        "url": {}
      }
    ],
    "date": "2022-02-02",
    "categories": [],
    "contents": "\nAs mentioned in the previous post, I’m working with a new database on the IAcHR rulings compiled by the PluriCourts project of the University of Oslo (Stiansen, Naurin, and Bøyum 2020). This dataset of amici actors has 425 observations of 2 variables (“Name of Amicus” and “Case ID”), indicating in which cases an amici actor participated in:\nA view of the dataset on amiciFrom raw data to an adjacency matrix\nIn order to work with this dataset, I need to put the data into a format that is suitable for network analysis. So, after cleaning the data, I create an adjacency matrix (nxn) where I can see how many times interveners have filed an amicus brief in the same case than each other. I asigned “0” to the diagonal of the matrix to ignore the ties from a node to itself.\n\n\ndata <- read.csv(\"CleanedData.csv\")\n\n#New column count\ndata$count <- 1\n\nlibrary(tidyr)\n\n#Gather the data at case level\nlev_data <- pivot_wider(data,id_cols = CaseID, names_from = `Name.of.Amicus`, values_from = count, values_fn = list(count = length), values_fill = list(count = 0))\n\n#Create the adjacency matrix\nmat <- as.matrix(lev_data[-1])\nad_matrix <- t(mat) %*% mat\ndiag(ad_matrix) <- 0\n\n\n\nAdjacency matrixDescribing the network dataset\nBefore describing the network dataset, I need first to create a network object from the dataset loaded (the adjacency network):\n\n\nlibrary(igraph)\namici_network <- graph.adjacency(ad_matrix, mode = \"undirected\", weighted = TRUE)\n\nis_directed(amici_network)\n\n\n[1] FALSE\n\nis_weighted(amici_network)\n\n\n[1] TRUE\n\nis_bipartite(amici_network)\n\n\n[1] FALSE\n\nNow, I can identify and describe content of nodes and links, and identify format of data set, Of course, from the previous steps we know that this a matrix, symmetric, and weighted. This means that each time there is a connection between two amici, each of them is filing a briefe before the court (symetrical), but these ties among amici are valued according to how many time they have intervened in the same cases.\nWe can also identify the network attributes:\n\n\n#size\nvcount(amici_network)\n\n\n[1] 403\n\necount(amici_network)\n\n\n[1] 3615\n\n#attributes names and content\nvertex_attr_names(amici_network)\n\n\n[1] \"name\"\n\nedge_attr_names(amici_network)\n\n\n[1] \"weight\"\n\nhead(V(amici_network)$name)\n\n\n[1] \"Fernando Linares Beltranena\"                                                     \n[2] \"Amnesty International\"                                                           \n[3] \"Association of the Bar of the City of New York\"                                  \n[4] \"Lawyers Committee for Human Rights\"                                              \n[5] \" The Central American Associaion of Families of Detained and Disappeared Persons\"\n[6] \"Minnesota Lawyers International Human Rights Committee\"                          \n\nhead(E(amici_network)$weight)\n\n\n[1] 2 2 1 3 1 1\n\nIt is also possible to describe the network structure:\n\n\n#Dyad census: because the ties are undirected we will expect that there is no assymetrical edges\nigraph::dyad.census(amici_network)\n\n\n$mut\n[1] 3615\n\n$asym\n[1] 0\n\n$null\n[1] 77388\n\n#Triad census\nigraph::triad_census(amici_network)\n\n\n [1] 9455588       0 1331612       0       0       0       0       0\n [9]       0       0    2600       0       0       0       0   37601\n\nIn terms of transitivity or global clustering, it is possible to see how the proption of connected triads in the network of amici that are complete is hight, meaning that almost all connected triads are transitive. Likewise, the local clustering coefficient (emphasis on low degree nodes) confirms the high transitivity of the network:\n\n\n#global clustering\ntransitivity(amici_network)\n\n\n[1] 0.9774703\n\n#local clustering coefficient\ntransitivity(amici_network, type=\"average\")\n\n\n[1] 0.9920321\n\n\n\n\n",
    "preview": {},
    "last_modified": "2022-02-06T19:29:48-05:00",
    "input_file": "describing-the-network-data.knit.md"
  },
  {
    "path": "posts/2022-01-26-project-and-network-data/",
    "title": "Description and Network Data",
    "description": "Read about the project and the network data",
    "author": [
      {
        "name": "Santiago Virgüez",
        "url": {}
      }
    ],
    "date": "2022-01-27",
    "categories": [],
    "contents": "\nIAcHRHave interest groups in the Inter-American Court of Human Rights (IAcHR) come to work together? How have their coalition strategies changed over time? The increasing legitimacy of amici participation in national courts have paved the way for interest groups (particularly nongovernmental organizations) to increase amici advocacy before international courts (Johnson and Amerasinghe 2009). Amicus briefs are perceived as one of the most effective and less costly methods of legal advocacy to nonjudicial actors (Krislov 1963). For this reason, scholars have begun to construct networks based on amicus briefs. Nevertheless, as Box-Steffensmeier et. al. (2017) have argued, these constructions provide little clue as to who works with whom and how interest actors change their coalition strategies over time.\nTo address these questions, I want to undertake an empirical study based on a new database on the IAcHR rulings compiled by the PluriCourts project of the University of Oslo (Stiansen, Naurin, and Bøyum 2020). I will update their Dataset on amici actors (See file “IACtHRamici.RDATA”) to include some new cases decided by the IAcHR and turn it into network data. This specific dataset has 425 observations of 2 variables (“Name of Amicus” and “Case ID”), indicating in which cases an amici actor participated in.\n\n\n\n",
    "preview": {},
    "last_modified": "2022-02-02T18:29:54-05:00",
    "input_file": "project-and-network-data.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome!",
    "description": "This is my new blog 'Friends of the Court'. I hope you enjoy \nreading about networks of amici actors in the Inter-American Court of Human Rights",
    "author": [
      {
        "name": "Santiago Virgüez",
        "url": {}
      }
    ],
    "date": "2022-01-26",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2022-01-26T23:17:05-05:00",
    "input_file": "welcome.knit.md"
  }
]
